snlkuharlocal/src/Catalogs/ПравилаПополненияСкладовМаркетплейсов/ПравилаПополненияСкладовМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаПополненияСкладовМаркетплейсов</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияМаркетПлейсы</name>
    <type>
      <types>EnumRef.КатегорииABC</types>
    </type>
  </attributes>
  <attributes>
    <name>ДнейТоварногоЗапаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппироватьРегионы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Регионы</name>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРаспределения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакГруппыРегиона</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/ПравилаПополненияСкладовМаркетплейсов/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
 
	
	КонтрольЗаписи =  МожноЗаписатьДокументЛокальная();
	если не КонтрольЗаписи.Успех тогда         
		ТекстОшибки = СтрСоединить(КонтрольЗаписи.ошибки,",");
        ВызватьИсключение ТекстОшибки;
	КонецЕсли;      	
	
	
КонецПроцедуры 


Функция МожноЗаписатьДокументЛокальная ()
	СтруктураВозврата = новый Структура("Успех,Ошибки",ложь,новый Массив);
	
	ПроверкаУникальности = КонтрольУникальности();
	если не ПроверкаУникальности.Успех тогда  
		МаркировкаКС.ДобавитьОшибки(СтруктураВозврата.Ошибки,ПроверкаУникальности.Ошибки);
	КонецЕсли;      

	
	ПроверкаОбщая = ОбщиеПроверки();
	если не ПроверкаОбщая.Успех тогда  
		МаркировкаКС.ДобавитьОшибки(СтруктураВозврата.Ошибки,ПроверкаОбщая.Ошибки);
	КонецЕсли; 	
	
	если СтруктураВозврата.Ошибки.Количество() = 0 тогда 
		СтруктураВозврата.Успех = Истина;
	КонецЕсли;	
	Возврат СтруктураВозврата;	
КонецФункции  

Функция КонтрольУникальности() 
	СтруктураВозврата = новый Структура("Успех,Ошибки",ложь,новый Массив);
	запрос = новый запрос;
	запрос.Текст ="ВЫБРАТЬ
	|	ПравилаПополненияСкладовМаркетплейсов.Код КАК Код
	|ИЗ
	|	Справочник.ПравилаПополненияСкладовМаркетплейсов КАК ПравилаПополненияСкладовМаркетплейсов
	|ГДЕ
	|	ПравилаПополненияСкладовМаркетплейсов.Ссылка <> &Ссылка
	|	И ПравилаПополненияСкладовМаркетплейсов.Контрагент = &Контрагент
	|	И ПравилаПополненияСкладовМаркетплейсов.КатегорияМаркетПлейсы = &КатегорияМаркетПлейсы
	|	И ПравилаПополненияСкладовМаркетплейсов.Организация = &Организация
	|	И НЕ ПравилаПополненияСкладовМаркетплейсов.ПометкаУдаления";  
	запрос.УстановитьПараметр("Ссылка",Ссылка);	
	запрос.УстановитьПараметр("Контрагент",Контрагент);
	запрос.УстановитьПараметр("КатегорияМаркетПлейсы",КатегорияМаркетПлейсы);
	запрос.УстановитьПараметр("Организация",Организация);    
	Выборка = запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл 
		СтруктураВозврата.Ошибки.добавить("Не уникальные правила контрагента. Существует такой же элемент с такими же контрагентом, категорией и организацией с кодом:"+ Выборка.код);
	КонецЦикла;
	
	если СтруктураВозврата.Ошибки.Количество() = 0 тогда 
		СтруктураВозврата.Успех = Истина;
	КонецЕсли;       
	
	Возврат СтруктураВозврата;
КонецФункции     


Функция ОбщиеПроверки() 
	СтруктураВозврата = новый Структура("Успех,Ошибки",ложь,новый Массив);        
	если Регионы.Количество()>0 тогда
		если ГруппироватьРегионы тогда
			запрос = новый запрос;  
			запрос.УстановитьПараметр("ТЧ",Регионы);
			//0 Сама ТЧ
			запрос.Текст = "ВЫБРАТЬ
			|	ТЧ.Регион КАК Регион,
			|	ТЧ.ПроцентРаспределения КАК ПроцентРаспределения,
			|	ТЧ.ПризнакГруппыРегиона КАК ПризнакГруппыРегиона
			|ПОМЕСТИТЬ ТЧРегионы
			|ИЗ
			|	&ТЧ КАК ТЧ
			|; 
			//1 проверка на то, что есть строчки с одинаковым признаком региона, но разным % распределения 
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТЧРегионы.ПризнакГруппыРегиона КАК ПризнакГруппыРегиона,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЧРегионы.ПроцентРаспределения) КАК ПроцентРаспределения
			|ИЗ
			|	ТЧРегионы КАК ТЧРегионы
			|
			|СГРУППИРОВАТЬ ПО
			|	ТЧРегионы.ПризнакГруппыРегиона
			|
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЧРегионы.ПроцентРаспределения) <> 1
			|;  
			//2 свернутые строчки по признаку региона и % распределения, для контроля того, что сумм строк даст 100% )
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТЧРегионы.ПризнакГруппыРегиона КАК ПризнакГруппыРегиона,
			|	ТЧРегионы.ПроцентРаспределения КАК ПроцентРаспределения
			|ИЗ
			|	ТЧРегионы КАК ТЧРегионы";
			
			ПакетДанных = запрос.ВыполнитьПакет();
			ВыборкаКривыхСтрок = ПакетДанных[1].выбрать(); 
			пока ВыборкаКривыхСтрок.следующий() цикл    
				СтруктураВозврата.Ошибки.Добавить("Обнаружен разный процент распределения у строк с признаком группы = "+ВыборкаКривыхСтрок.ПризнакГруппыРегиона);
			КонецЦикла;    
			
			ТаблицаСвернутыхСтрок = ПакетДанных[2].Выгрузить();  
			ИтоговыйПроцент = ТаблицаСвернутыхСтрок.Итог("ПроцентРаспределения");	
		иначе
			ИтоговыйПроцент = Регионы.Итог("ПроцентРаспределения");	
		КонецЕсли;	 
		
		если ИтоговыйПроцент <> 100 тогда   
			СтруктураВозврата.Ошибки.Добавить("Сумма строк по проценту распределения даёт не 100, а "+ИтоговыйПроцент);
		КонецЕсли;
	КонецЕсли;
	
	если СтруктураВозврата.Ошибки.Количество() = 0 тогда 
		СтруктураВозврата.Успех = Истина;
	КонецЕсли;       
	
	Возврат СтруктураВозврата;
КонецФункции     




Функция КратноеНаименованиеОрганизации ()    
	КодОрганизации = ПолучитьРеквизитШапки(Организация,"Код","Справочник");
	если КодОрганизации = "SS-001" тогда 
		Возврат "ЕЕЭ";
	ИначеЕсли КодОрганизации = "SSP-99" тогда 
		Возврат "БТК";
	ИначеЕсли КодОрганизации = "SSR-03" тогда 
		Возврат "МПС";
	Иначе
		Возврат Организация.Наименование;
	КонецЕсли; 
КонецФункции
